[
    {
        "title": "Finished The Site!",
        "text": "Hi baby, once I write this, i'll officially be done making this site after 3 months of working on it, and in 3 days will be our 1 year anniversary. I'm going to show this to you when i see you tomorrow though, i dont think i'll be able to wait another 2 days lol, especially since i haven't seen you in a month.. There's a bunch of other features and ideas i have that could be added, but i wanted to save some things for us to do together with the site, i love making stuff with you :).\n\n I loved every second making this site because for the last 3 months, i got to obsess over the last year of our lives, and go through every detail. I cherish every picture, song, mixtape, notes app entry, outfit, item, etc etc etc that we've ever shared and im so excited to share more with you.\n\n One year ago today i asked if you'd \"be down to hangout this weekend\". I remember I was scared of things being weird with the band if we started dating, but more so i was scared because i had never felt so connected and drawn to a person in my life, and we had only really just met a month before. It's scary knowing that you're falling for someone, and knowing that you're completely at their mercy. Regardless of my fear though, something about you kept drawing me closer to you. I swear it felt like the universe wanted us together lmao, everything about last summer was so natural and so easy, it felt like it was supposed to happen.\n\n Now, a year later, i can honestly say that that decision to ask you to \"hangout\" was the best decision i have ever made in my life. That one decision yielded more love than I could have hoped for and a partner who is everything i have ever wanted in one. You're so smart, so effortlessly beautiful, so kind-hearted, so naturally talented, so creative, and so loving, among so many other things. You make me laugh, you make want to be a better person, you've helped me get closer to who I want to be. Every day i grow more in love with you. You complete me.\n\n If I could relive the last year of my life I would in a heartbeat, but since i can't i'll live the rest of my life with you. I love you Tayla!\n\nHappy aniversary baby\n\n- harsh",
        "date": "8/7/2025"
    }, 
    {
        "title": "AZW Video 1",
        "text": "hii i made the azw video for the home page a couple days ago and I can't stop watching it..i've never been more happy or had as much fun than the last 10 months, 12 days and 52 minutes and 17 seconds i've spent with you. thank you for making me happy. once again im on facetime with you as i type this and youre asleep, we have work in the morning but i miss you and i wanted to watch the video..good night baby i love you i'll talk to you in the morning <3\n\n - harsh",
        "date": "6/23/2025"
    }, 
    {
        "title": "First Blog Post",
        "text": "hi baby im on ft with you rn and youre sleeping. i love watching u sleep (not in a weird way) youre so cute it makes me so happy. i started working on the arizonawokhardt website today, i think itll turn out really cool. i have a little less than 3 months to finish it so i think i can get it done. i want it to be like a digital scrapbook of our relationship that we can update as time goes by. theres a blog section where u can write me notes and i can write u notes like on co star. a music section where you can post songs that remind u of me and vice versa. a gallery with pictures of us that we love. an outfits page where we can look back at what we were wearing on certain memorable days. a scrapbook page with random items and artifacts of meaning to only us. you can listen to all of the mixes we ve made for each other on the site and it also says exactly how long we ve been together. if everything goes to plan, you should be reading this on our 1 year anniversary. if youre reading this before or after, i either spoiled it too early or it took me longer than i thought it would...anyways youre still sleeping like an angel i think im going to go join you. i hope i make it into your dreams, you always make your way into mine.  i love you baby!!\n\n - harsh",
        "date": "5/19/2025"
    }, 
    {
        "title": "Tayla's Doom Generation Live Thoughts", 
        "text": "doom generation live thoughts\n- shes kind of annoying\n- is that slowdive??? why are they trying to fuck over the glovebox\n- oh theyre just from california\n- actually i wld be mean all the time too if  ihad to date a loser that never stood up for me\n- wait i lowkey get her whyd she go for the newports instead of running\n- her fit is cute theyre all so 90s\n- is he wasian\n- “fuck… a long time… three months…” yeah ive said that shit before lowkey\n- this is Not a heterosexual gregg araki film is it\n- no way wasian got turned on mid piss\n- no way its comfortable to fuck in a bathtub\n- is this movie just animalistic hedonism\n- cinematography dope\n- kinky fro.. bro.. hello.. is this commentsry about like poor white / punk white america and like identity politics as a means of separating marginalized communities or was that totally unnecessary and hes just racist for the sake of it\n- how is She mad at him when Shes the one that cheated\n- is she a gemini Lowkey i Love her\n- wait i think i get it\n- this is Not a heterosexual gregg araki movie\n- this is about teenage cynicism ? and violence and sex and drugs and giving into hedonistic pleasures and satisfactions as some sort of temporary alleviation ?\n- is that cocteau twins\n- beer + bathtub + jerking off + nursery rhymes God i shldve been a boy\n- hes hungry bc hes a grown boy i didnt know how to feel about the dry dialogue at first but i kinda get it now\n- 6.66 i think im missing something in my interpretation\n- let the boys fuck\n- is that medicine im fuckign cruign\n- poor wasian boy cucked again i so sorry\n- No Fucking Way shes 5’1 92 lbs ur playing in my fucking face\n- he got cucked before they ever woke up tg Oh my god\n- the smiths reference her outfit is cute again Love \n- dude the soundtrack is so goated What\n- all three of them exist in every local scene\n- let them be gay bruh\n- oh its the Fucking homosexuality is punished thing i shouldve known this was a gregg araki movie Fuck\n- sorry to wasians everywhere i take back everything",
        "date": "1/7/2025"
    },
    {
        "title": "Round Rock Date Ideas",
        "text": "rr donuts\nculvers\ncross spot\n360 bridge\nlibrary\nart museum\ndt austin clothes stores\nrrhs",
        "date": "11/6/2024"
    },
    {
        "title": "No",
        "text": "H: III\nT: IIII",
        "date": "9/7/2024"
    },
    {
        "title": "OG Tayla Harsh Watchlist",
        "text": "1. Fifth Element\n2. Hackers\n3. Dazed and confused\n4. Kiss kiss bang bang\n5. Mulholland dr\n6. Jojobrabbit",
        "date": "8/11/2024"
    },
    {
        "title": "Tayla's Diary Entry After First Heel Weekend", 
        "text": "12:04AM   Jul 22, 24\n\nHi I'm back. I wanted to write about Harsh again. Firstly, however, let me recount my day.\n\n1. Woke up past 12.\n\n2. Had Harsh reteach me song chords with Nick in their apartment\n\n3. Burger Mojo w/ Josh. Got a milkshake. Choc 12 oz. He told me about his ex trauma.\n\n4. Sculpture hunting w/ Brandon & Grace. A park by her house where slaves are buried unbeknownst to visitors. Rewatched Eternal Sunshine.\n\nOk back again. If I'm being honest, I just read Harsh's natal chart (He told me leaving he was born in Cedar Rapids). And then I scrolled on TikTok for a couple minutes. Anyway.\n\nThe way I feel about Harsh is very quiet. It's like a whisper. It's not overwhelming, and it doesn't make me feel crazy, which is unique. When I talk to him and it's just us I feel like we can see each other. Regarding the last entry, I think I would pick different words to describe him. He's very compassionate, empathetic, creative, expressive, helpful, a very good teacher, perceptive, imaginative. I do feel that he has a rich inner world. I like seeing him smile. I like making him laugh. Perhaps that is just how it feels to connect to somebody. I can't stop listening to the single version of \"You Only Live Once\" demo by The Strokes called \"I'll Try Anything Once\". It's a B-Side. It reminded me of Harsh when I saw it in a TikTok edit 20 minutes ago. Maybe we can just be good friends. I admire him.\n\nI don't know how to distinguish between connection and attraction sometimes. Perhaps It isn't wise to develop feelings for him. But I adore him, in a quiet way. He asked me this morning if I got back home okay. He had went to bed early and I didn't get to say bye. I have never met someone as considerate as him. He will be home for someone one day. His smile brings peace. I trust him. It is very dificult for me to trust people I don't know. Maybe the solution is to stop ruminating on the situation so much.. I like getting along with him. I won't break my own heart over this. Maybe that's all anything has to be. Just getting along. He's very sweet. And so genuinely empathetic. His admiration for the arts and all things creative. I hope he will be home to someone one day, if he wants it, and lets it in.\n\nGoodnight!\n\n<3 Tayla Diza",
        "date": "7/22/2024"
    },
    {
        "title": "Nb places",
        "text": "Fischer park dope at sunset\nRiver road view dope at sunset\nMechs ...\nMaybe gruene river grill lowk never been inside\nMaybe krauses but its loud at night and a scary amount of white people\nLanda park lots deer !\nDowtown is nice at night and Christmas wow tree lighting but shops close early\nCreekside is ok . Biggest bucees though\nMaybe not the factory but the faust bridge jump spot maybe if not closed off. Night? Don't want to swim to it\nRuins by tube shoot probably under construction :( too many bugs anyway\nGruene pretty at night but shops close 6ish\nDrive in 730? Check movies",
        "date": "10/07/2024"
    }, 
    {
        "title": "Aug20 3:43am harsh room",
        "text": "No\nWere we thinking about the same thing?\nThing i was thinking about-\nI wna kiss him but idk like when. And also how to even bring that up. And also what if i forgot how to kiss. But every tjme i see him i want to kiss him",
        "date": "08/20/2024"
    },
    {
        "title": "5:50PM",
        "text": "the way things feel with him is so true and perfect and what ive been looking for my whole life if unbeknownst to myself. this is what ive been chasing",
        "date": "08/20/2024"
    },
    {
        "title": "Adharsh pawan rajavel fact sheet cheat sheet the basics type shit",
        "text": "Cedar rapids\nNo spiders\nRed\nCars movie\nThomas the trainn red one\n5\nMcd spicy mc chicken sprite or hi c\nNo bananas\nPsych show goat\nAutumn\nPbj grape jelly smuckers wonder bread\ncreamy pbj thin spread no chips in sandwiches\nDoes not fw strawberries (seeds ick grapes also low tier)\nRead meat not fan except bacon\nChocolate milkshake over vanilla strawberry\nWeighted blanket fan\nCitrus candies orange/lemon/etc\nMango apple on top\nChhez its over gokdfish\nNo pistachio\nSensitive teeth melt icicle sticks\nTiger raccoon Elephant",
        "date": "08/11/2024"
    },
    {
        "title":"Song 7",
        "text":"Secrets you don't know I keep\nI don't know if you're listening to me\nCall me when you get home\nFall asleep watching reruns alone\n\nI don't know how to tell you\nMaybe I'll bury it with me\nI sort of wish you liked me too\n\nTell me you won't forget\nEverything you never said\nTell me do you regret\nEverything you never did\n\nI don't think that I'll tell you\nI'll probably bury it with me\nI think I wish you liked me too",
        "date": "07/30/2024"
    }, 
    {
        "title": "2:36am harsh room",
        "text": "sometimes i watch you and i feel dizzy with love",
        "date": "11/16/2024"
    },
    {
        "title": "September 7",
        "text": "I love adharsh pawan rajavel",
        "date": "9/7/2024"
    },
    {
        "title": "The First Diary Entry Ever That I Read to U in My Bedroom Once in the Spring but was Too Embarrassed to Give a Copy of Bc it's a Tayla Journal Entry and Wordy and Vulnerable and I Kept Getting Distracted But I Added Hella Line Breaks in This Transcript so it's Easier to Digest",
        "text": "07/21\n\n04:38 AM\n\nHi! Today I wanted to use this space to share how I'm feeling. I'm listening to \"Show Me How\" by Men I Trust. Today I went to go see Harsh & Nick record at a house studio. I hopped on and did background vocals for the first song off Heel's EP. Or first single release I guess. That was cool. I've never done anything like that before. Normally I get really scared and can't perform in front of other people. Like when I had to perform with Grace/Brandon or my brother and his roommate. But I feel comfortable with Heel. Mostly Harsh, I think. He's made me feel comfortable existing and creating around him. It's so interesting and rare.\n\nAfter, we went and got Chili's. I left my leftovers on the top of my car leaving. Half a burger and some fries is scattered on the side of Texas Ave. Practice after. Harsh helped me learn 4, 6, 7, 10, 12 correctly since I've been learning them wrong. We went to their apt around 11/past and smoked. I got way too high. I remember Nick and Andres talking about video games, one of them saying the phrase \"Among Us\", and then my vision going out. TV static came in, and then I felt pain in my head as I fainted and collapsed on their balcony furniture. Damn. Embarrassing as hell I was way too high.\n\nHarsh helped me get up. He let me hold his hand as he led me to sit down inside on the couch. It was really nice actually. He gave me his water. We watched Nice Guys(?) with Ryan Gosling and I actually loved it. I was so confused at first but it was an excellent buddy cop type of movie and I loved how elaborate it was. \n\nMcDonalds after. Andres and Nick got food. $5 combo and flurry respectively. Got back and watched the \"Starsky and Hutch\" remake. It dragged on for so long. And it was only an hour and a half. Fucking unbelievable. I snorted a lot but as a whole the movie sucked. Star-studded cast though. \n\nI'm coming down from my high now. I was still a little high on my way home. Fun fact I'm only writing in red because this is the pen I let Z use to write in my notebook. Red is his favorite color. When I was tripsitting him. I'm probably gonna have forgotten that/these details about the red pen when I read this. Anyway. \n\nI'm writing to confess. Confess confess confess your sins. Bladee. I fear that I have a crush on my bandmate. Harsh. I was always attracted to him. When we first met. He has nice bone structure, and a really nice smile, and a cool way of decorating himself. I like his eyes, and how dark his hair is. He cuts it himself. I do too. I guess most people who would want to start a band cut their own hair. But I also fw his personality. I'm attracted to him AND I like him. That never happens. He's sweet, and genuine, and ambitious, and creative, and smart, and I like the way he tells stories. I think its awesome how close He and Nick are. I like that he's shy, but brave, and how he has an entire world going on in his mind. I kind of wish I knew what he was thinking all the time. I think it's funny that he laughed when I said they would probably be good at rolling because they're good with their fingers from instruments. \n\nI get kind of nervous around him and it makes me sad because I want to present myself as I am. I'm tired of not being seen. But maybe I'm also just actually like this. I hate how hard it is for me to socialize in group settings without spewing filler. I was tweaking about that in my mind on their balcony. I was being quiet and having a difficult time maintaining conversation. I wish I had the magic other people do when conversing sometimes. I don't know what to do about it. I don't know if there's anything I can. I try to put myself out there, say yes to plans, be present, and take risks, but I can't grasp the magic. Shit sucks so bad. I don't like not feeling normal. Reminds me of childhood, and middle school, and a winter break I shed tears to that fact. Maybe one day. I prevail. \n\nI don't know what to do about Harsh either. I want to not think about it but it worries me. I can't have a crush on my bandmate. That's awful. I feel almost cruel to myself, and the band, and Harsh. You know his hands were sweaty when we first met? Or had a first actual conversation. In his garage in RR. Not when I walked up to him post-formal function and started commenting on his Ricks while he was gone off an edible. I got into a car accident later (hubcap removal) and had to sleep at Cas' apartment with Gabriel and Kory. April 27. \n\nI don't think he likes me more than a friend, but I'm glad he likes me as a friend. He didn't ask me my birthday when I asked about everyone's. I think it's so interesting that he knew the dates. He seems to care about the little things. He also remembered what the funny guy walking in front of us in the hallway back from the McDonald's trip was wearing when he and Nick saw him for the first time. \n\nI want to say that I wish he liked me back, but I won't, and can't. I like Heel. I hope it works out with me in it. I don't want to cause a mess. I guess in that sense I can move on quickly and find someone else to take up the empty space in my brain. Maybe after college. Time is of a rarity right now for me. \n\nIt's 5:17 now. I should shower. And apologize to everyone for fainting tomorrow maybe. I don't know if that makes it more embarassing. Goodnight red book of words. I hope you're doing alright Tayla. Sleep well. Take care of yourself.\n\n\n<3 Tayla Diza <3\n\n\n\nMonterey - Starflyer59",
        "date": "7/21/2024"
    },
    {
        "title": "Arizona Gets Vulnerable",
        "text": "08/20/24 2:46PM\n\nOk! It's been about a month probably since the last entry. Today's the second day of classes. I have a lecture in an hour. Things have changed since the last entry. Since the last two entries. The weekend following that first weekend of band practices we all practiced again, and I realized that I could get rid of my lil crush. I tried really hard to get over it but then, that Saturday night, he let me stay up on his balcony with him to talk after everyone went to sleep. I told him secrets I forgot I was keeping. I was high. I remember being hyper-conscious of the fact my deodorant had worn off and I lowkey stunk. I spent the next two weeks trying to get over this crush. I was almost successful on Friday the 9th (two weeks after), but he came into town early to see me. We hung out at an abandoned warehouse. He told me he liked me too. I was so scared. Telling him I thought he was cute was the most I was going to move. It's been a week and a half since and I'm lowkey whipped. I slept over at his last night. I've been sleeping over at his a bunch since the Saturday night after we confessed. Bad optics we're not even fucking - my roommates do not believe me. Thus, I don't tell them anymore. I didn't tell them I slept over at his last night. \n\nI can't believe I've only really been getting to know him for a little over a month. I've never been or felt more safe and at ease with someone. I'm lowkey scared that what we have isn't true. It's so real to me. I know it's only been a month, and we haven't even kissed, but I'm also scared I love him. To love without possession. Love without attachment. I am enamored of him, genuinely; not in an attached, codependent way. I accept him for who he is, and I take him as he is. He might be the most beautiful boy in the world. It's cute when he gets too nervous to make eye contact with me sometimes. I've been getting like that too recently. I adore him, and looking at him, and learning to read his expressions, but recently I've been getting nervous making eye contact with him because I keep thinking about kissing him and I'm scared. To kiss someone for the first time is so vulnerable to me. I don't know why. I don't believe that it's inherently so, but for me, it feels so personal - you're sharing something so intimate with another person. I don't know how some people just have drunk makeouts. But if I were to psychoanalyze myself, I imagine it's just an extension of how I'm not as open and vulnerable as I try to be, or as I attempt to portray myself as. \n\nAnyway. Soon I'll gather the courage. I just need the right time. God give me a sign. Guide me... I'm so deadass... What he and I have and share means more to me than what I've ever shared with another human being in a romantic context before. I hope we figure this out. Everything about this feels so right in a way I've never fucking felt before. I don't even have to convince or lie to myself like usual. Everything was instant with him. It's like I was looking for him this whole time and didn't realize it. \n\nI'm actually only writing an update because I found a note in my notes app about what I should/am looking for if I ever decided to date again. It's from July 25, which, granted, is after I first started crushing on Harsh, but he literally checks all the boxes. I said - \n\nWhat am I looking for in a relationship?\nAddition to my life, no codependency, separate lives choosing to have each other\nQualities - considerate, smart, open-minded, appreciate arts, funny, easy for me to talk to/be good friends with, empathetic. \nKind, patient, communicative, different from me but we can show each other our separate worlds and still enjoy spending time together. Brave, preferably in love with me, open about thoughts and feelings, creative. \n\nHe literally meets all the requirements. He is all of those things and more. He's sweet, and intuitive, and perceptive, observant, understanding, imaginative, sensitive, risk-taking, sure of what he wants and getting it, and so so true. He never pretends to be anything, he's always presenting himself as he is, and he takes everything the same - he never projects ideas or images onto me, and takes me as I am. I like who I am when I'm with him. If he's playing me I swear to god this will push me into a serious villain arc. Thought I was a villain in 2023? Nah. I wasn't even trying. I was just mentally ill. Watch me try. I'm trusting him, and us, and me, which I never before thought I was capable of, but he makes me feel capable of a lot of things. \n\nBut maybe it's too early to say I love him. \n\n\n<3TaylaDiza",
        "date": "8/20/24"
    }
]