[
    {
        "title": "Finished The Site!",
        "text": "Hi baby, once I write this, i'll officially be done making this site after 3 months of working on it, and in 3 days will be our 1 year anniversary. I'm going to show this to you when i see you tomorrow though, i dont think i'll be able to wait another 2 days lol, especially since i haven't seen you in a month.. There's a bunch of other features and ideas i have that could be added, but i wanted to save some things for us to do together with the site, i love making stuff with you :).\n\n I loved every second making this site because for the last 3 months, i got to obsess over the last year of our lives, and go through every detail. I cherish every picture, song, mixtape, notes app entry, outfit, item, etc etc etc that we've ever shared and im so excited to share more with you.\n\n One year ago today i asked if you'd \"be down to hangout this weekend\". I remember I was scared of things being weird with the band if we started dating, but more so i was scared because i had never felt so connected and drawn to a person in my life, and we had only really just met a month before. It's scary knowing that you're falling for someone, and knowing that you're completely at their mercy. Regardless of my fear though, something about you kept drawing me closer to you. I swear it felt like the universe wanted us together lmao, everything about last summer was so natural and so easy, it felt like it was supposed to happen.\n\n Now, a year later, i can honestly say that that decision to ask you to \"hangout\" was the best decision i have ever made in my life. That one decision yielded more love than I could have hoped for and a partner who is everything i have ever wanted in one. You're so smart, so effortlessly beautiful, so kind-hearted, so naturally talented, so creative, and so loving, among so many other things. You make me laugh, you make want to be a better person, you've helped me get closer to who I want to be. Every day i grow more in love with you. You complete me.\n\n If I could relive the last year of my life I would in a heartbeat, but since i can't i'll live the rest of my life with you. I love you Tayla!\n\nHappy aniversary baby\n\n- harsh",
        "date": "8/7/2025"
    }, 
    {
        "title": "AZW Video 1",
        "text": "hii i made the azw video for the home page a couple days ago and I can't stop watching it..i've never been more happy or had as much fun than the last 10 months, 12 days and 52 minutes and 17 seconds i've spent with you. thank you for making me happy. once again im on facetime with you as i type this and youre asleep, we have work in the morning but i miss you and i wanted to watch the video..good night baby i love you i'll talk to you in the morning <3\n\n - harsh",
        "date": "6/23/2025"
    }, 
    {
        "title": "First Blog Post",
        "text": "hi baby im on ft with you rn and youre sleeping. i love watching u sleep (not in a weird way) youre so cute it makes me so happy. i started working on the arizonawokhardt website today, i think itll turn out really cool. i have a little less than 3 months to finish it so i think i can get it done. i want it to be like a digital scrapbook of our relationship that we can update as time goes by. theres a blog section where u can write me notes and i can write u notes like on co star. a music section where you can post songs that remind u of me and vice versa. a gallery with pictures of us that we love. an outfits page where we can look back at what we were wearing on certain memorable days. a scrapbook page with random items and artifacts of meaning to only us. you can listen to all of the mixes we ve made for each other on the site and it also says exactly how long we ve been together. if everything goes to plan, you should be reading this on our 1 year anniversary. if youre reading this before or after, i either spoiled it too early or it took me longer than i thought it would...anyways youre still sleeping like an angel i think im going to go join you. i hope i make it into your dreams, you always make your way into mine.  i love you baby!!\n\n - harsh",
        "date": "5/19/2025"
    }, 
    {
        "title": "Tayla's Doom Generation Live Thoughts", 
        "text": "doom generation live thoughts\n- shes kind of annoying\n- is that slowdive??? why are they trying to fuck over the glovebox\n- oh theyre just from california\n- actually i wld be mean all the time too if  ihad to date a loser that never stood up for me\n- wait i lowkey get her whyd she go for the newports instead of running\n- her fit is cute theyre all so 90s\n- is he wasian\n- “fuck… a long time… three months…” yeah ive said that shit before lowkey\n- this is Not a heterosexual gregg araki film is it\n- no way wasian got turned on mid piss\n- no way its comfortable to fuck in a bathtub\n- is this movie just animalistic hedonism\n- cinematography dope\n- kinky fro.. bro.. hello.. is this commentsry about like poor white / punk white america and like identity politics as a means of separating marginalized communities or was that totally unnecessary and hes just racist for the sake of it\n- how is She mad at him when Shes the one that cheated\n- is she a gemini Lowkey i Love her\n- wait i think i get it\n- this is Not a heterosexual gregg araki movie\n- this is about teenage cynicism ? and violence and sex and drugs and giving into hedonistic pleasures and satisfactions as some sort of temporary alleviation ?\n- is that cocteau twins\n- beer + bathtub + jerking off + nursery rhymes God i shldve been a boy\n- hes hungry bc hes a grown boy i didnt know how to feel about the dry dialogue at first but i kinda get it now\n- 6.66 i think im missing something in my interpretation\n- let the boys fuck\n- is that medicine im fuckign cruign\n- poor wasian boy cucked again i so sorry\n- No Fucking Way shes 5’1 92 lbs ur playing in my fucking face\n- he got cucked before they ever woke up tg Oh my god\n- the smiths reference her outfit is cute again Love \n- dude the soundtrack is so goated What\n- all three of them exist in every local scene\n- let them be gay bruh\n- oh its the Fucking homosexuality is punished thing i shouldve known this was a gregg araki movie Fuck\n- sorry to wasians everywhere i take back everything",
        "date": "1/7/2025"
    },
    {
        "title": "Round Rock Date Ideas",
        "text": "rr donuts\nculvers\ncross spot\n360 bridge\nlibrary\nart museum\ndt austin clothes stores\nrrhs",
        "date": "11/6/2024"
    },
    {
        "title": "No",
        "text": "H: III\nT: IIII",
        "date": "9/7/2024"
    },
    {
        "title": "OG Tayla Harsh Watchlist",
        "text": "1. Fifth Element\n2. Hackers\n3. Dazed and confused\n4. Kiss kiss bang bang\n5. Mulholland dr\n6. Jojobrabbit",
        "date": "8/11/2024"
    },
    {
        "title": "Tayla's Diary Entry After First Heel Weekend", 
        "text": "Hi I'm back. I wanted to write about Harsh again. Firstly, however let me recount my day.\n\n1. Woke up past 12\n\n2. Had Harsh teach me song chords with Nick in their apartment\n\n3. Burger Mojo w/ Josh. Got a milkshake Choc 12 oz. He told me about his ex trauma.\n\n4. Sculpture hunting w/ Brandon & Grace. A park by her house where slaves are buried unbeknownst to visitors. Rewatched Eternal Sunshine.\n\nOk back again. If I'm being honest, I just read Harsh's natal chart (He told me leaving he was born in Cedar Rapids). And then I scrolled on TikTok for a couple minutes. Anyway. \n\nThe way I feel about Harsh is very quiet. It's like a whisper. It's not overwhelming, and it doesn't make me feel crazy, which is unique. When I talk to him and it's just us I feel like we can see eachother. Regarding the last entry, I think I would pick different words to describe him. He's very compassionate, empathetic, creative, expressive, helpful, a very good teacher, perceptive, imaginative. I do feel that he has a rich inner world. I like seeing him smile. I like making him laugh. Perhaps that is just how it feels to connect to somebody. I can't stop listening to the single version of \"You Only Live Once\" demo by The Strokes called \"I'll Try Anything Once\". It's a B-Side. It reminded me of Harsh when I saw it in a TikTok edit 20 minutes ago. Maybe we can just be good friends. I admire him.\n\nI don't know how to distinguish between connection and attraction sometimes. Perhaps It isn't wise to develop feelings for him. But I adore him, in a quiet way. He asked me this morning if I got back home okay. He had went to bed early and I didn't get to say bye. I have never met someone as considerate as him. He will be home for someone one day. His smile brings peace. I trust him. It is very dificult for me to trust people I don't know. Maybe the solution is to stop ruminating on the situation so much..I like getting along with him. I won't break my own heart over this. Maybe that's all anything has to be. Just getting along. He's very sweet. And so genuinely empathetic. His admiration for the arts and all things creative. I hope he will be home to someone one day. if he wants it, and lets it in.\n\nGoodnight!\n\n<3 Tayla Diza",
        "date": "7/22/2024"
    },
    {
        "title": "Nb places",
        "text": "Fischer park dope at sunset\nRiver road view dope at sunset\nMechs ...\nMaybe gruene river grill lowk never been inside\nMaybe krauses but its loud at night and a scary amount of white people\nLanda park lots deer !\nDowtown is nice at night and Christmas wow tree lighting but shops close early\nCreekside is ok . Biggest bucees though\nMaybe not the factory but the faust bridge jump spot maybe if not closed off. Night? Don't want to swim to it\nRuins by tube shoot probably under construction :( too many bugs anyway\nGruene pretty at night but shops close 6ish\nDrive in 730? Check movies",
        "date": "10/07/2024"
    }, 
    {
        "title": "Aug20 3:43am harsh room",
        "text": "No\nWere we thinking about the same thing?\nThing i was thinking about-\nI wna kiss him but idk like when. And also how to even bring that up. And also what if i forgot how to kiss. But every tjme i see him i want to kiss him",
        "date": "08/20/2024"
    },
    {
        "title": "5:50PM",
        "text": "the way things feel with him is so true and perfect and what ive been looking for my whole life if unbeknownst to myself. this is what ive been chasing",
        "date": "08/20/2024"
    },
    {
        "title": "Adharsh pawan rajavel fact sheet cheat sheet the basics type shit",
        "text": "Cedar rapids\nNo spiders\nRed\nCars movie\nThomas the trainn red one\n5\nMcd spicy mc chicken sprite or hi c\nNo bananas\nPsych show goat\nAutumn\nPbj grape jelly smuckers wonder bread\ncreamy pbj thin spread no chips in sandwiches\nDoes not fw strawberries (seeds ick grapes also low tier)\nRead meat not fan except bacon\nChocolate milkshake over vanilla strawberry\nWeighted blanket fan\nCitrus candies orange/lemon/etc\nMango apple on top\nChhez its over gokdfish\nNo pistachio\nSensitive teeth melt icicle sticks\nTiger raccoon Elephant",
        "date": "08/11/2024"
    },
    {
        "title":"Song 7",
        "text":"Secrets you don't know I keep\nI don't know if you're listening to me\nCall me when you get home\nFall asleep watching reruns alone\n\nI don't know how to tell you\nMaybe I'll bury it with me\nI sort of wish you liked me too\n\nTell me you won't forget\nEverything you never said\nTell me do you regret\nEverything you never did\n\nI don't think that I'll tell you\nI'll probably bury it with me\nI think I wish you liked me too",
        "date": "07/30/2024"
    }, 
    {
        "title": "2:36am harsh room",
        "text": "sometimes i watch you and i feel dizzy with love",
        "date": "11/16/2024"
    },
    {
        "title": "September 7",
        "text": "I love adharsh pawan rajavel",
        "date": "9/7/2024"
    }

]