[
    {
        "title": "First Blog Post",
        "text": "hi baby im on ft with you rn and youre sleeping. i love watching u sleep (not in a weird way) youre so cute it makes me so happy. i started working on the arizonawokhardt website today, i think itll turn out really cool. i have a little less than 3 months to finish it so i think i can get it done. i want it to be like a digital scrapbook of our relationship that we can update as time goes by. theres a blog section where u can write me notes and i can write u notes like on co star. a music section where you can post songs that remind u of me and vice versa. a gallery with pictures of us that we love. an outfits page where we can look back at what we were wearing on certain memorable days. a scrapbook page with random items and artifacts of meaning to only us. you can listen to all of the mixes we ve made for each other on the site and it also says exactly how long we ve been together. if everything goes to plan, you should be reading this on our 1 year anniversary. if youre reading this before or after, i either spoiled it to early or it took me longer than i thought it would...anyways youre still sleeping like an angel i think im going to go join you. i hope i make it into your dreams, you always make your way into mine.  i love you baby!! - H",
        "date": "5/19/2025"
    }, 
    {
        "title": "Diary Entry After Second Weekend", 
        "text": "Hi I'm back. I wanted to write about Harsh again. Firstly, however let me recount my day.\n\n1. Woke up past 12\n\n2. Had Harsh teach me song chords with Nick in their apartment\n\n3. Burger Mojo w/ Josh. Got a milkshake Choc 12 oz. He told me about his ex trauma.\n\n4. Sculpture hunting w/ Brandon & Grace. A park by her house where slaves are buried unbeknownst to visitors. Rewatched Eternal Sunshine.\n\nOk back again. If I'm being honest, I just read Harsh's natal chart (He told me leaving he was born in Cedar Rapids). And the I scrolled on TikTok for a couple minutes. Anyway. \n\nThe way I feel about Harsh is very quiet. It's like a whisper. It's not overwhelming, and it doesn't make me feel crazy, which is unique. When I talk to him and it's just us I feel like we can see eachother. Regarding the last entry, I think I would pick different words to describe him. He's very compassionate, empathetic, creative, expressive, helpful, a very good teacher, perceptive, imaginative. I do feel that he has a rich inner world. I like seeing him smile. I like making him laugh. Perhaps that is just how it feels to connect to somebody. I can't stop listening to the single version of \"You Only Live Once\" demo by The Strokes called \"I'll Try Anything Once\". It's a B-Side. It reminded me of Harsh when I saw it in a TikTok edit 20 minutes ago. Maybe we can just be good friends. I admire him.\n\nI don't know how to distinguish between connection and attraction sometimes. Perhaps It isn't wise to develop feelings for him. But I adore him, in a quiet way. He asked me this morning if I got back home okay. He had went to bed early and I didn't get to say bye. I have never met someone as considerate as him. He will be home for someone one day. His smile brings peace. I trust him. It is very dificult for me to trust people I don't know. Maybe the solution is to stop ruminating on the situation so much..I like getting along with him. I won't break my own heart over this. Maybe that's all anything has to be. Just getting along. He's very sweet. And so genuinely empathetic. His admiration for the arts and all things creative. I hope he will be home to someone one day. if he wants it, and lets it in.\n\nGoodnight!\n\n<3 Tayla Diza",
        "date": "7/22/2024"
    }
]